Examples/PNASpaper/micromodel/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     dissolTransportDyMFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         20000;

deltaT          5;

writeControl    adjustableRunTime;

writeInterval   10000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression uncompressed;

timeFormat      general;

timePrecision   10;

runTimeModifiable yes;

checkFrequency 1;
remeshFrequency 200;

libs (
"libfvMotionSolverGCFOAM.so"
"libmeshToolsGCFOAM.so"
);

adjustTimeStep true;
maxMeshCo 0.005;

maxDeltaT 50;

OptimisationSwitches
{
    commsType       blocking;
}

// ************************************************************************* //
