Examples/PNASpaper/micromodel/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

lx0 -.0000600;
ly0 -.0000600;
lz0 -.00003;

lx .0300600;
ly .0300600;
lz .00003;



vertices
(
    ($lx0       $ly0    $lz0)
    ($lx        $ly0    $lz0)
    ($lx        $ly     $lz0)
    ($lx0       $ly     $lz0)
    ($lx0       $ly0    $lz)
    ($lx        $ly0    $lz)
    ($lx        $ly     $lz)
    ($lx0       $ly     $lz)
);


blocks          
(
    hex (0 1 2 3 4 5 6 7) (1004 1004 1) simpleGrading (1 1 1)
);

edges           
(
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (1 2 6 5)
        );
    }
    inlet
    {
		type patch;
		faces
		(
                (0 1 5 4)
		);
    } 
    outlet
    {
		type patch;
		faces
		(
                (3 7 6 2)
		);
    }
    frontandback
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
